{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 12,
   "id": "7a97e8a5",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "True"
      ]
     },
     "execution_count": 12,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "\n",
    "from langchain_community.graphs import Neo4jGraph\n",
    "from langchain_ollama import ChatOllama\n",
    "import re\n",
    "from langchain_core.prompts import  PromptTemplate\n",
    "import uuid\n",
    "from dotenv import load_dotenv\n",
    "\n",
    "load_dotenv(override = True)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "id": "b536dd5e",
   "metadata": {},
   "outputs": [],
   "source": [
    "graph = Neo4jGraph()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 22,
   "id": "e6d89a0f",
   "metadata": {},
   "outputs": [],
   "source": [
    "topic_title = 'Could U.S. involvement in Iran trigger a larger global war?'"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 23,
   "id": "42d97c63",
   "metadata": {},
   "outputs": [],
   "source": [
    "original_post = graph.query(\n",
    "    \"\"\"\n",
    "    MATCH (p:OriginalPost)\n",
    "    WHERE p.topic_title = $topic_title\n",
    "    RETURN p\n",
    "    \"\"\",\n",
    "    {'topic_title': topic_title}\n",
    ")\n",
    "original_post_id = original_post[0]['p']['id'] if original_post and 'p' in original_post[0] and 'id' in original_post[0]['p'] else None\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 24,
   "id": "533375c5",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Total arguments for topic: 23\n"
     ]
    }
   ],
   "source": [
    "argument_count_result = graph.query(\n",
    "    \"\"\"\n",
    "    MATCH (a:Argument)--(p)\n",
    "    WHERE (p:Post OR p:OriginalPost) AND p.topic_title = $topic_title\n",
    "    RETURN count(DISTINCT a) AS total_arguments\n",
    "    \"\"\",\n",
    "    {'topic_title': topic_title}\n",
    ")\n",
    "\n",
    "total_arguments = argument_count_result[0]['total_arguments'] if argument_count_result else 0\n",
    "print(f\"Total arguments for topic: {total_arguments}\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 25,
   "id": "7d8acd0e",
   "metadata": {},
   "outputs": [],
   "source": [
    "results = graph.query(\n",
    "    \"\"\"\n",
    "    MATCH (a:Argument)--(mn:MaxNeefCategory), (a)--(p)\n",
    "    WHERE (p:Post OR p:OriginalPost) AND p.topic_title = $topic_title\n",
    "    RETURN mn.id AS category, collect(DISTINCT a.motivations_descriptions) AS motivations, count(DISTINCT a) AS argument_count\n",
    "    ORDER BY category\n",
    "    \"\"\", \n",
    "    {'topic_title':topic_title}\n",
    ")\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "46453c5d",
   "metadata": {},
   "outputs": [],
   "source": [
    "MODEL = \"deepseek-r1:8b\"\n",
    "\n",
    "summary_extractor = ChatOllama(\n",
    "        model=MODEL,\n",
    "        temperature=0,\n",
    "        #format=\"json\"\n",
    "    )\n",
    "\n",
    "summary_extraction_prompt = PromptTemplate(\n",
    "    input_variables=[\"motivations\"],\n",
    "    template= \"\"\"\n",
    "    Your task is to process the following strands of text, containing the descriptions of various motivations, and summarize it.\n",
    "    Make a sumarization of the most common themes and what was overall said. \n",
    "    You dont need to go too in depth, only enough to get the pig picture.\n",
    "    The text comes from many users on the internet, on the context of a discussion forum. \n",
    "    Input:\n",
    "\n",
    "    \\\"\\\"\\\"{motivations}\\\"\\\"\\\"\n",
    "    \"\"\"\n",
    "    )\n",
    "    \n",
    "summary_chain = summary_extraction_prompt | summary_extractor\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 27,
   "id": "eb9e2a9b",
   "metadata": {},
   "outputs": [],
   "source": [
    "def remove_think_tags(text):\n",
    "    return re.sub(r'<think>.*?</think>', '', text, flags=re.DOTALL)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "94663e05",
   "metadata": {},
   "outputs": [],
   "source": [
    "def create_summary_node(new_id, description, n_arguments_used):\n",
    "    # Ensures that the MotivationSummary node with this ID does not exist before creating it\n",
    "    presence = n_arguments_used / total_arguments if total_arguments else 0\n",
    "\n",
    "    graph.query(\n",
    "        \"\"\"\n",
    "        MERGE (n:MotivationSummary {id: $id})\n",
    "        ON CREATE SET n.description = $description,\n",
    "                      n.n_arguments_analyzed = $n_arguments_analyzed,\n",
    "                      n.n_arguments_used = $n_arguments_used,\n",
    "                      n.presence = $presence\n",
    "        ON MATCH SET n.description = $description,\n",
    "                     n.n_arguments_analyzed = $n_arguments_analyzed,\n",
    "                     n.n_arguments_used = $n_arguments_used,\n",
    "                     n.presence = $presence\n",
    "        \"\"\",\n",
    "        {\n",
    "            \"id\": new_id,\n",
    "            \"description\": description,\n",
    "            \"n_arguments_analyzed\": total_arguments,\n",
    "            \"n_arguments_used\": n_arguments_used,\n",
    "            \"presence\": presence\n",
    "        }\n",
    "    )\n",
    "\n",
    "    return False\n",
    "\n",
    "\n",
    "def create_summary_relations(new_id, category_id, post_id):\n",
    "    # Creates a REFLECTS relationship only if it does not already exist\n",
    "    graph.query(\n",
    "        \"\"\"\n",
    "        MATCH (a:MotivationSummary {id: $novo_id}), (b:MaxNeefCategory {id: $categoria_id})\n",
    "        MERGE (a)-[:REFLECTS]->(b)\n",
    "        \"\"\",\n",
    "        {\"novo_id\": new_id, \"categoria_id\": category_id}\n",
    "    )\n",
    "\n",
    "    # Creates a SUMMARIZES relationship only if it does not already exist\n",
    "    graph.query(\n",
    "        \"\"\"\n",
    "        MATCH (a:MotivationSummary {id: $novo_id}), (b:OriginalPost {id: $post_id})\n",
    "        MERGE (a)-[:SUMMARIZES]->(b)\n",
    "        \"\"\",\n",
    "        {\"novo_id\": new_id, \"post_id\": post_id}\n",
    "    )\n",
    "\n",
    "    return False"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "46f8b8a2",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Category:  Affection\n",
      "Motivations:  [['Wants to safeguard civilian lives and global stability by opposing military invasions.', 'Seeks to critically analyze and understand patterns of geopolitical aggression and leadership failures.', 'Values national sovereignty and self-determination, opposing violations of freedom by powerful states.', 'Expresses empathy for victims of war and conflict who suffer from aggressive military actions.']]\n",
      "Argumentos presentes:  1\n",
      "Category:  Creativity\n",
      "Motivations:  [['Wants readers to grasp how shifts in national power reshape global strategy and influence.', 'Advocates replacing nostalgic visions with innovative, forward-looking policies to stay relevant.', 'Seeks to motivate public and policy engagement by highlighting the contest over international leadership.']]\n",
      "Argumentos presentes:  1\n",
      "Category:  Freedom\n",
      "Motivations:  [['Wants to maintain regional stability and safety by preventing a nuclear arms race among neighboring countries.', \"Seeks to preserve China's strategic autonomy and freedom of action by avoiding constraints imposed by neighboring nuclear powers.\", 'Aims to foster cooperative and non-hostile relations with regional neighbors to ensure peaceful coexistence.'], ['Wants to safeguard civilian lives and global stability by opposing military invasions.', 'Seeks to critically analyze and understand patterns of geopolitical aggression and leadership failures.', 'Values national sovereignty and self-determination, opposing violations of freedom by powerful states.', 'Expresses empathy for victims of war and conflict who suffer from aggressive military actions.'], ['Emphasizes that patient, long-term planning based on relative growth data leads to more informed decision-making.', 'Highlights that by growing stronger before acting, China ensures its strategic security and stability.', 'Asserts that building strength over time preserves China’s future autonomy in geopolitical decisions.'], ['Wants to protect society from instability and harm caused by those seeking profit through repeating historical mistakes.', 'Opposes unfair exploitation that undermines others’ autonomy and well-being.', 'Advocates for critical and responsible use of historical knowledge to prevent repeating harmful cycles.']]\n",
      "Argumentos presentes:  4\n",
      "Category:  Identity\n",
      "Motivations:  [['Wants to prevent a loss of regime legitimacy and domestic stability by avoiding the image of an ‘incomplete’ nation on a major political milestone.', 'Aims to uphold national pride and cohesion by ensuring China appears territorially whole at its 100-year anniversary.'], ['Affirming national unity by emphasizing Taiwan as integral territory to reinforce a sense of belonging.', 'Using logical coherence to argue against invasion by pointing out one does not attack one’s own people.', 'Emphasizing stability and safety to discourage the prospect of internal military conflict.']]\n",
      "Argumentos presentes:  2\n",
      "Category:  Participation\n",
      "Motivations:  [['Stressing that without US-supplied bunker busters and equipment, Israel cannot secure its borders and neutralize threats.', 'Informing the audience about Israel’s technical limitations to underline the necessity of allied cooperation in military operations.'], ['Aims to inform readers about the structure and risks of global supply chains centered on Taiwan’s semiconductor industry.', 'Seeks to emphasize the need to safeguard semiconductor production to maintain economic stability worldwide.', 'Intends to motivate governments and businesses to engage in policies and partnerships supporting Taiwan’s chip manufacturing.'], ['Wants readers to grasp how shifts in national power reshape global strategy and influence.', 'Advocates replacing nostalgic visions with innovative, forward-looking policies to stay relevant.', 'Seeks to motivate public and policy engagement by highlighting the contest over international leadership.'], ['Wants to maintain regional stability and safety by preventing a nuclear arms race among neighboring countries.', \"Seeks to preserve China's strategic autonomy and freedom of action by avoiding constraints imposed by neighboring nuclear powers.\", 'Aims to foster cooperative and non-hostile relations with regional neighbors to ensure peaceful coexistence.'], ['Wants to ground the discussion in realistic military capabilities to avoid exaggeration and misinformation.', 'Aims to reduce public fear of imminent conflict by stressing the logistical challenges of an amphibious invasion.', 'Encourages informed debate on foreign policy by focusing on factual assessments rather than alarmist scenarios.'], ['Wants readers to critically reassess the simplistic assumption that the CCP will always act rationally.', 'Aims to warn about the security risks of underestimating how domestic pressures in China could lead to reckless actions.', 'Seeks to prompt policymakers and the public to actively consider internal Chinese factors when shaping foreign policy decisions.'], ['Belief that historical knowledge fosters critical thinking and informed decision-making.', 'Desire to prevent repeating past mistakes to ensure safety and stability.', 'Encouragement of societal responsibility to actively learn and apply lessons from history.'], ['Wants to highlight historical parallels to caution against repeating past policy mistakes.', 'Seeks to encourage critical evaluation of current government rhetoric about military action.', 'Aims to foster public vigilance and involvement in foreign policy discourse to prevent undue escalation.'], ['Warns about serious safety and stability risks from military intervention to protect lives and regional security.', 'Emphasizes the need for critical analysis of political decisions to understand and avoid repeating past mistakes.', 'Urges citizens to engage in political discourse and hold leaders accountable for foreign policy choices.'], ['Emphasizes our repeated failure to heed historical lessons to foster deeper critical reflection.', 'Expresses concern that ignoring history risks repeating past conflicts and societal harm.', 'Aims to spur public responsibility and engagement in learning from history to influence current decisions.']]\n",
      "Argumentos presentes:  10\n",
      "Category:  Protection\n",
      "Motivations:  [['Stressing that without US-supplied bunker busters and equipment, Israel cannot secure its borders and neutralize threats.', 'Informing the audience about Israel’s technical limitations to underline the necessity of allied cooperation in military operations.'], ['Aims to inform readers about the structure and risks of global supply chains centered on Taiwan’s semiconductor industry.', 'Seeks to emphasize the need to safeguard semiconductor production to maintain economic stability worldwide.', 'Intends to motivate governments and businesses to engage in policies and partnerships supporting Taiwan’s chip manufacturing.'], ['Seeks to prevent escalation into a wider conflict to preserve safety and stability.', 'Highlights the need for careful strategic assessment to inform decision-making.'], ['Wants to maintain regional stability and safety by preventing a nuclear arms race among neighboring countries.', \"Seeks to preserve China's strategic autonomy and freedom of action by avoiding constraints imposed by neighboring nuclear powers.\", 'Aims to foster cooperative and non-hostile relations with regional neighbors to ensure peaceful coexistence.'], ['Desires to reassure that rational actors will avoid conflict, promoting political stability and safety.', 'Uses historical examples and logical risk assessment to form an evidence-based argument, reflecting a need for critical understanding.', \"Highlights potential destruction of Taiwan's semiconductor industry to underscore material and economic consequences, reflecting concern for subsistence needs.\"], ['Concern about preventing a destabilizing military confrontation until the balance of power is more even', 'Desire to apply rational analysis of military capabilities to understand and predict geopolitical developments'], ['Wants to safeguard civilian lives and global stability by opposing military invasions.', 'Seeks to critically analyze and understand patterns of geopolitical aggression and leadership failures.', 'Values national sovereignty and self-determination, opposing violations of freedom by powerful states.', 'Expresses empathy for victims of war and conflict who suffer from aggressive military actions.'], ['Emphasizes China’s incentive to maintain regional stability and security rather than risk aggression against Taiwan.', 'Offers a reasoned analysis of shifting global power balances to clarify China’s strategic choices.'], ['Emphasizes that patient, long-term planning based on relative growth data leads to more informed decision-making.', 'Highlights that by growing stronger before acting, China ensures its strategic security and stability.', 'Asserts that building strength over time preserves China’s future autonomy in geopolitical decisions.'], ['Wants to prevent a loss of regime legitimacy and domestic stability by avoiding the image of an ‘incomplete’ nation on a major political milestone.', 'Aims to uphold national pride and cohesion by ensuring China appears territorially whole at its 100-year anniversary.'], ['Prefers maintaining a peaceful but imperfect arrangement to avoid the risks and harms of actual conflict', 'Values a pragmatic compromise over ideological purity through critical assessment of less harmful options'], ['Wants to ground the discussion in realistic military capabilities to avoid exaggeration and misinformation.', 'Aims to reduce public fear of imminent conflict by stressing the logistical challenges of an amphibious invasion.', 'Encourages informed debate on foreign policy by focusing on factual assessments rather than alarmist scenarios.'], ['Emphasizes the high security and stability risks of an invasion by pointing out likely US military support for Taiwan, highlighting potential dangers and costs.', 'Offers a reasoned geopolitical analysis to inform readers about strategic consequences and encourage critical evaluation of the invasion scenario.'], ['Affirming national unity by emphasizing Taiwan as integral territory to reinforce a sense of belonging.', 'Using logical coherence to argue against invasion by pointing out one does not attack one’s own people.', 'Emphasizing stability and safety to discourage the prospect of internal military conflict.'], ['Wants readers to critically reassess the simplistic assumption that the CCP will always act rationally.', 'Aims to warn about the security risks of underestimating how domestic pressures in China could lead to reckless actions.', 'Seeks to prompt policymakers and the public to actively consider internal Chinese factors when shaping foreign policy decisions.'], ['Belief that historical knowledge fosters critical thinking and informed decision-making.', 'Desire to prevent repeating past mistakes to ensure safety and stability.', 'Encouragement of societal responsibility to actively learn and apply lessons from history.'], ['Wants to protect society from instability and harm caused by those seeking profit through repeating historical mistakes.', 'Opposes unfair exploitation that undermines others’ autonomy and well-being.', 'Advocates for critical and responsible use of historical knowledge to prevent repeating harmful cycles.'], ['Wants to highlight historical parallels to caution against repeating past policy mistakes.', 'Seeks to encourage critical evaluation of current government rhetoric about military action.', 'Aims to foster public vigilance and involvement in foreign policy discourse to prevent undue escalation.'], ['Warns about serious safety and stability risks from military intervention to protect lives and regional security.', 'Emphasizes the need for critical analysis of political decisions to understand and avoid repeating past mistakes.', 'Urges citizens to engage in political discourse and hold leaders accountable for foreign policy choices.'], ['Seeks to provide a fact‐based comparison to improve understanding and prevent misconceptions about the conflict.', 'Aims to reassure that a major land invasion is unlikely, promoting a sense of safety and stability.'], ['Emphasizing Iran’s hostility and past attacks to underscore the threat level and justify protective measures', 'Informing the audience about Iran’s ideological stance and military actions for a clearer understanding of the situation'], ['Emphasizes our repeated failure to heed historical lessons to foster deeper critical reflection.', 'Expresses concern that ignoring history risks repeating past conflicts and societal harm.', 'Aims to spur public responsibility and engagement in learning from history to influence current decisions.']]\n",
      "Argumentos presentes:  22\n",
      "Category:  Subsistence\n",
      "Motivations:  [['Desires to reassure that rational actors will avoid conflict, promoting political stability and safety.', 'Uses historical examples and logical risk assessment to form an evidence-based argument, reflecting a need for critical understanding.', \"Highlights potential destruction of Taiwan's semiconductor industry to underscore material and economic consequences, reflecting concern for subsistence needs.\"]]\n",
      "Argumentos presentes:  1\n",
      "Category:  Understanding\n",
      "Motivations:  [['Stressing that without US-supplied bunker busters and equipment, Israel cannot secure its borders and neutralize threats.', 'Informing the audience about Israel’s technical limitations to underline the necessity of allied cooperation in military operations.'], ['Aims to inform readers about the structure and risks of global supply chains centered on Taiwan’s semiconductor industry.', 'Seeks to emphasize the need to safeguard semiconductor production to maintain economic stability worldwide.', 'Intends to motivate governments and businesses to engage in policies and partnerships supporting Taiwan’s chip manufacturing.'], ['Seeks to prevent escalation into a wider conflict to preserve safety and stability.', 'Highlights the need for careful strategic assessment to inform decision-making.'], ['Wants readers to grasp how shifts in national power reshape global strategy and influence.', 'Advocates replacing nostalgic visions with innovative, forward-looking policies to stay relevant.', 'Seeks to motivate public and policy engagement by highlighting the contest over international leadership.'], ['Desires to reassure that rational actors will avoid conflict, promoting political stability and safety.', 'Uses historical examples and logical risk assessment to form an evidence-based argument, reflecting a need for critical understanding.', \"Highlights potential destruction of Taiwan's semiconductor industry to underscore material and economic consequences, reflecting concern for subsistence needs.\"], ['Concern about preventing a destabilizing military confrontation until the balance of power is more even', 'Desire to apply rational analysis of military capabilities to understand and predict geopolitical developments'], ['Wants to safeguard civilian lives and global stability by opposing military invasions.', 'Seeks to critically analyze and understand patterns of geopolitical aggression and leadership failures.', 'Values national sovereignty and self-determination, opposing violations of freedom by powerful states.', 'Expresses empathy for victims of war and conflict who suffer from aggressive military actions.'], ['Emphasizes China’s incentive to maintain regional stability and security rather than risk aggression against Taiwan.', 'Offers a reasoned analysis of shifting global power balances to clarify China’s strategic choices.'], ['Emphasizes that patient, long-term planning based on relative growth data leads to more informed decision-making.', 'Highlights that by growing stronger before acting, China ensures its strategic security and stability.', 'Asserts that building strength over time preserves China’s future autonomy in geopolitical decisions.'], ['Prefers maintaining a peaceful but imperfect arrangement to avoid the risks and harms of actual conflict', 'Values a pragmatic compromise over ideological purity through critical assessment of less harmful options'], ['Wants to ground the discussion in realistic military capabilities to avoid exaggeration and misinformation.', 'Aims to reduce public fear of imminent conflict by stressing the logistical challenges of an amphibious invasion.', 'Encourages informed debate on foreign policy by focusing on factual assessments rather than alarmist scenarios.'], ['Emphasizes the high security and stability risks of an invasion by pointing out likely US military support for Taiwan, highlighting potential dangers and costs.', 'Offers a reasoned geopolitical analysis to inform readers about strategic consequences and encourage critical evaluation of the invasion scenario.'], ['Affirming national unity by emphasizing Taiwan as integral territory to reinforce a sense of belonging.', 'Using logical coherence to argue against invasion by pointing out one does not attack one’s own people.', 'Emphasizing stability and safety to discourage the prospect of internal military conflict.'], ['Wants readers to critically reassess the simplistic assumption that the CCP will always act rationally.', 'Aims to warn about the security risks of underestimating how domestic pressures in China could lead to reckless actions.', 'Seeks to prompt policymakers and the public to actively consider internal Chinese factors when shaping foreign policy decisions.'], ['Belief that historical knowledge fosters critical thinking and informed decision-making.', 'Desire to prevent repeating past mistakes to ensure safety and stability.', 'Encouragement of societal responsibility to actively learn and apply lessons from history.'], ['Wants to protect society from instability and harm caused by those seeking profit through repeating historical mistakes.', 'Opposes unfair exploitation that undermines others’ autonomy and well-being.', 'Advocates for critical and responsible use of historical knowledge to prevent repeating harmful cycles.'], ['Wants to highlight historical parallels to caution against repeating past policy mistakes.', 'Seeks to encourage critical evaluation of current government rhetoric about military action.', 'Aims to foster public vigilance and involvement in foreign policy discourse to prevent undue escalation.'], ['Warns about serious safety and stability risks from military intervention to protect lives and regional security.', 'Emphasizes the need for critical analysis of political decisions to understand and avoid repeating past mistakes.', 'Urges citizens to engage in political discourse and hold leaders accountable for foreign policy choices.'], ['Seeks to provide a fact‐based comparison to improve understanding and prevent misconceptions about the conflict.', 'Aims to reassure that a major land invasion is unlikely, promoting a sense of safety and stability.'], ['Emphasizing Iran’s hostility and past attacks to underscore the threat level and justify protective measures', 'Informing the audience about Iran’s ideological stance and military actions for a clearer understanding of the situation'], ['Emphasizes our repeated failure to heed historical lessons to foster deeper critical reflection.', 'Expresses concern that ignoring history risks repeating past conflicts and societal harm.', 'Aims to spur public responsibility and engagement in learning from history to influence current decisions.']]\n",
      "Argumentos presentes:  21\n"
     ]
    }
   ],
   "source": [
    "for line in results:\n",
    "\n",
    "\n",
    "    # Process text\n",
    "    print(\"Category: \", line.get(\"category\"))\n",
    "    print(\"Motivations: \", line.get(\"motivations\"))\n",
    "    print(\"Arguments present: \", line.get(\"argument_count\"))\n",
    "\n",
    "\n",
    "    input = {\n",
    "        #'category' : line.get(\"category\"),\n",
    "        'motivations' : line.get(\"motivations\")\n",
    "    }\n",
    "\n",
    "    response = summary_chain.invoke(input).content\n",
    "    description = remove_think_tags(response)\n",
    "\n",
    "\n",
    "    # Create nodes\n",
    "    id = str(uuid.uuid4())\n",
    "\n",
    "    create_summary_node(new_id=id, description=description, n_arguments_used=line.get(\"argument_count\"))\n",
    "\n",
    "\n",
    "    # Create relationships\n",
    "\n",
    "    create_summary_relations(new_id=id, category_id=line.get(\"category\"), post_id=original_post_id)\n",
    "\n",
    "    "
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": ".venv",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.12.10"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
